# Regular Expressons ( 정규 표현식 )
# 정규식은 하나의 언어이다.
# 좀 더 스마트하게 검색을 해보자는 아이디어 이다.
# 검색 하여 그 문장을 추출할 수도 있다.
# 프로그래밍 가능한 와일드카드같은 표현이다.
# 반복문은 없지만 함축된 언어로 찾고자하는 패턴과 매치되는 문자열을 찾아 준다.
# 긴 문장에서 python이라는 단어가 들어가 있는 것을 모두 찾는다고 가정 해 보자
# 정규식은 정보를 찾는 것을 굉장히 구조적으로 만들어 준다.
# 굉장희 효과적이지만 복잡하고 어려울 수 있다.
# 익숙해 지는데 시간이 걸릴 수 있다.
# 정규식은 1960년데 만들어 졌다
# 언어데 대한 연구를 하다가 컴퓨터가 이해할 수 있는 언어를 생각하다보니 탄생되었다.
# 정규식을 알면 멋진 사람이 될 수 있다.

# 정규식은 프로그래밍 언어이다.
# 줄이나 키워드 기반이 아닌 문자를 기준으로 한다.
# 몇 가지 유효한 문자가 있다.
# 특별한 의미를 가지고 있다.
# 파이썬은 import re를 통해 사용 할 수 있다.
# 정규식 라이브러리를 가져와야 한다.
# 내장 함수도 몇 개 있다.
# re.search()은 매개 변수를 받아 문자열 내에서 검색하는 함수 이다.
# re.findall()은 문자열을 쭉 순회하면서 정해진 패턴을 만족하면 추출하는 함수 이다.